avr-rust/avrd/packs/atmega/AT90PWM81.atdf
    <module caption="EEPROM" name="EEPROM">
      <register-group caption="EEPROM" name="EEPROM">
        <register caption="EEPROM Read/Write Access Bytes" name="EEAR" offset="0x3E" size="2">
          <bitfield caption="EEPROM Address bytes" mask="0x01FF" name="EEAR"/>
        </register>
        <register caption="EEPROM Data Register" name="EEDR" offset="0x3D" size="1">
          <bitfield caption="EEPROM Data bits" mask="0xFF" name="EEDR"/>
        </register>
        <register caption="EEPROM Control Register" name="EECR" offset="0x3C" size="1">
          <bitfield caption="None Volatile Busy Memory Busy" mask="0x80" name="NVMBSY"/>
          <bitfield caption="EEPROM Page Access" mask="0x40" name="EEPAGE"/>
          <bitfield caption="EEPROM Programming Mode" mask="0x30" name="EEPM"/>
          <bitfield caption="EEPROM Ready Interrupt Enable" mask="0x08" name="EERIE"/>
          <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMWE"/>
          <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEWE"/>
          <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
        </register>
      </register-group>
    </module>
    <module caption="Power Stage Controller" name="PSC">
      <register-group caption="Power Stage Controller" name="PSC0">
        <register caption="PSC 0 Input Capture Register " name="PICR0" offset="0x68" size="2">
          <bitfield caption="PSC 0 Capture Software Trigger Bit" mask="0x8000" name="PCST0"/>
          <bitfield caption="PSC 0 Input Capture Bytes" mask="0x0FFF" name="PICR0"/>
        </register>
        <register caption="PSC 0 Input B Control" name="PFRC0B" offset="0x63" size="1">
          <bitfield caption="PSC 0 Capture Enable Input Part B" mask="0x80" name="PCAE0B"/>
          <bitfield caption="PSC 0 Input Select for Part B" mask="0x40" name="PISEL0B"/>
          <bitfield caption="PSC 0 Edge Level Selector on Input Part B" mask="0x20" name="PELEV0B"/>
          <bitfield caption="PSC 0 Filter Enable on Input Part B" mask="0x10" name="PFLTE0B"/>
          <bitfield caption="PSC 0 Retrigger and Fault Mode for Part B" mask="0x0F" name="PRFM0B"/>
        </register>
        <register caption="PSC 0 Input A Control" name="PFRC0A" offset="0x62" size="1">
          <bitfield caption="PSC 0 Capture Enable Input Part A" mask="0x80" name="PCAE0A"/>
          <bitfield caption="PSC 0 Input Select for Part A" mask="0x40" name="PISEL0A"/>
          <bitfield caption="PSC 0 Edge Level Selector on Input Part A" mask="0x20" name="PELEV0A"/>
          <bitfield caption="PSC 0 Filter Enable on Input Part A" mask="0x10" name="PFLTE0A"/>
          <bitfield caption="PSC 0 Retrigger and Fault Mode for Part A" mask="0x0F" name="PRFM0A"/>
        </register>
        <register caption="PSC 0 Control Register" name="PCTL0" offset="0x32" size="1">
          <bitfield caption="PSC 0 Prescaler Selects" mask="0xC0" name="PPRE0"/>
          <bitfield caption="PSC 0 Balance Flank Width Modulation" mask="0x24" name="PBFM0"/>
          <bitfield caption="PSC 0 Asynchronous Output Control B" mask="0x10" name="PAOC0B"/>
          <bitfield caption="PSC 0 Asynchronous Output Control A" mask="0x08" name="PAOC0A"/>
          <bitfield caption="PSC0 Complete Cycle" mask="0x02" name="PCCYC0"/>
          <bitfield caption="PSC 0 Run" mask="0x01" name="PRUN0"/>
        </register>
        <register caption="PSC 0 Configuration Register" name="PCNF0" offset="0x31" size="1">
          <bitfield caption="PSC 0 Fifty" mask="0x80" name="PFIFTY0"/>
          <bitfield caption="PSC 0 Autolock" mask="0x40" name="PALOCK0"/>
          <bitfield caption="PSC 0 Lock" mask="0x20" name="PLOCK0"/>
          <bitfield caption="PSC 0 Mode" mask="0x18" name="PMODE0"/>
          <bitfield caption="PSC 0 Output Polarity" mask="0x04" name="POP0"/>
          <bitfield caption="PSC 0 Input Clock Select" mask="0x02" name="PCLKSEL0"/>
        </register>
        <register caption="Output Compare RB Register " name="OCR0RB" offset="0x44" size="2">
          <bitfield caption="Output Compare 0 RB" mask="0xFFFF" name="OCR0RB"/>
        </register>
        <register caption="Output Compare SB Register " name="OCR0SB" offset="0x42" size="2">
          <bitfield caption="Output Compare 0 SB" mask="0x0FFF" name="OCR0SB"/>
        </register>
        <register caption="Output Compare RA Register " name="OCR0RA" offset="0x4A" size="2">
          <bitfield caption="Output Compare 0 RA" mask="0x0FFF" name="OCR0RA"/>
        </register>
        <register caption="Output Compare SA Register " name="OCR0SA" offset="0x60" size="2">
          <bitfield caption="Output Compare 0 SA" mask="0x0FFF" name="OCR0SA"/>
        </register>
        <register caption="PSC0 Synchro and Output Configuration" name="PSOC0" offset="0x6A" size="1">
          <bitfield caption="PSC Input Select" mask="0x80" name="PISEL0A1"/>
          <bitfield caption="PSC Input Select" mask="0x40" name="PISEL0B1"/>
          <bitfield caption="Synchronisation out for ADC selection" mask="0x30" name="PSYNC0"/>
          <bitfield caption="PSCOUT01 Output Enable" mask="0x04" name="POEN0B"/>
          <bitfield caption="PSCOUT00 Output Enable" mask="0x01" name="POEN0A"/>
        </register>
        <register caption="PSC0 Interrupt Mask Register" name="PIM0" offset="0x2F" size="1">
          <bitfield caption="External Event B Interrupt Enable" mask="0x10" name="PEVE0B"/>
          <bitfield caption="External Event A Interrupt Enable" mask="0x08" name="PEVE0A"/>
          <bitfield caption="End of Enhanced Cycle Enable" mask="0x02" name="PEOEPE0"/>
          <bitfield caption="End of Cycle Interrupt Enable" mask="0x01" name="PEOPE0"/>
        </register>
        <register caption="PSC0 Interrupt Flag Register" name="PIFR0" offset="0x30" size="1">
          <bitfield caption="PSC 0 Output A Activity" mask="0x80" name="POAC0B"/>
          <bitfield caption="PSC 0 Output A Activity" mask="0x40" name="POAC0A"/>
          <bitfield caption="External Event B Interrupt" mask="0x10" name="PEV0B"/>
          <bitfield caption="External Event A Interrupt" mask="0x08" name="PEV0A"/>
          <bitfield caption="Ramp Number" mask="0x06" name="PRN0"/>
          <bitfield caption="End of PSC0 Interrupt" mask="0x01" name="PEOP0"/>
        </register>
      </register-group>
      <register-group caption="Power Stage Controller" name="PSC2">
        <register caption="PSC 2 Input Capture Register" name="PICR2" offset="0x6C" size="2">
          <bitfield caption="PSC 2 Capture Software Trigger Bit" mask="0x8000" name="PCST2"/>
          <bitfield caption="PSC 2 Input Capture Bytes" mask="0x0FFF" name="PICR2"/>
        </register>
        <register caption="PSC 2 Input B Control" name="PFRC2B" offset="0x67" size="1">
          <bitfield caption="PSC 2 Capture Enable Input Part B" mask="0x80" name="PCAE2B"/>
          <bitfield caption="PSC 2 Input Select for Part B" mask="0x40" name="PISEL2B"/>
          <bitfield caption="PSC 2 Edge Level Selector on Input Part B" mask="0x20" name="PELEV2B"/>
          <bitfield caption="PSC 2 Filter Enable on Input Part B" mask="0x10" name="PFLTE2B"/>
          <bitfield caption="PSC 2 Retrigger and Fault Mode for Part B" mask="0x0F" name="PRFM2B"/>
        </register>
