avr-rust/avrd/packs/atmega/AT90PWM81.atdf
        <register caption="PSC 2 Input B Control" name="PFRC2A" offset="0x66" size="1">
          <bitfield caption="PSC 2 Capture Enable Input Part A" mask="0x80" name="PCAE2A"/>
          <bitfield caption="PSC 2 Input Select for Part A" mask="0x40" name="PISEL2A"/>
          <bitfield caption="PSC 2 Edge Level Selector on Input Part A" mask="0x20" name="PELEV2A"/>
          <bitfield caption="PSC 2 Filter Enable on Input Part A" mask="0x10" name="PFLTE2A"/>
          <bitfield caption="PSC 2 Retrigger and Fault Mode for Part A" mask="0x0F" name="PRFM2A"/>
        </register>
        <register caption="PSC 2 Control Register" name="PCTL2" offset="0x36" size="1">
          <bitfield caption="PSC 2 Prescaler Selects" mask="0xC0" name="PPRE2"/>
          <bitfield caption="Balance Flank Width Modulation" mask="0x20" name="PBFM2"/>
          <bitfield caption="PSC 2 Asynchronous Output Control B" mask="0x10" name="PAOC2B"/>
          <bitfield caption="PSC 2 Asynchronous Output Control A" mask="0x08" name="PAOC2A"/>
          <bitfield caption="PSC2 Auto Run" mask="0x04" name="PARUN2"/>
          <bitfield caption="PSC2 Complete Cycle" mask="0x02" name="PCCYC2"/>
          <bitfield caption="PSC 2 Run" mask="0x01" name="PRUN2"/>
        </register>
        <register caption="PSC 2 Configuration Register" name="PCNF2" offset="0x35" size="1">
          <bitfield caption="PSC 2 Fifty" mask="0x80" name="PFIFTY2"/>
          <bitfield caption="PSC 2 Autolock" mask="0x40" name="PALOCK2"/>
          <bitfield caption="PSC 2 Lock" mask="0x20" name="PLOCK2"/>
          <bitfield caption="PSC 2 Mode" mask="0x18" name="PMODE2"/>
          <bitfield caption="PSC 2 Output Polarity" mask="0x04" name="POP2"/>
          <bitfield caption="PSC 2 Input Clock Select" mask="0x02" name="PCLKSEL2"/>
          <bitfield caption="PSC 2 Output Matrix Enable" mask="0x01" name="POME2"/>
        </register>
        <register caption="PSC 2 Enhanced Configuration Register" name="PCNFE2" offset="0x70" size="1">
          <bitfield caption="" mask="0xE0" name="PASDLK2"/>
          <bitfield caption="" mask="0x10" name="PBFM21"/>
          <bitfield caption="" mask="0x08" name="PELEV2A1"/>
          <bitfield caption="" mask="0x04" name="PELEV2B1"/>
          <bitfield caption="" mask="0x02" name="PISEL2A1"/>
          <bitfield caption="" mask="0x01" name="PISEL2B1"/>
        </register>
        <register caption="Output Compare RB Register " name="OCR2RB" offset="0x48" size="2">
          <bitfield caption="Output Compare 2 RB" mask="0xFFFF" name="OCR2RB"/>
        </register>
        <register caption="Output Compare SB Register " name="OCR2SB" offset="0x46" size="2">
          <bitfield caption="Output Compare 2 SB" mask="0x0FFF" name="OCR2SB"/>
        </register>
        <register caption="Output Compare RA Register " name="OCR2RA" offset="0x4E" size="2">
          <bitfield caption="Output Compare 2 RA" mask="0x0FFF" name="OCR2RA"/>
        </register>
        <register caption="Output Compare SA Register " name="OCR2SA" offset="0x64" size="2">
          <bitfield caption="Output Compare 2 SA" mask="0x0FFF" name="OCR2SA"/>
        </register>
        <register caption="PSC 2 Output Matrix" name="POM2" offset="0x6F" size="1">
          <bitfield caption="Output Matrix Output B Ramps" mask="0xF0" name="POMV2B"/>
          <bitfield caption="Output Matrix Output A Ramps" mask="0x0F" name="POMV2A"/>
        </register>
        <register caption="PSC2 Synchro and Output Configuration" name="PSOC2" offset="0x6E" size="1">
          <bitfield caption="PSC 2 Output 23 Select" mask="0xC0" name="POS2" lsb="2"/>
          <bitfield caption="Synchronization Out for ADC Selection" mask="0x30" name="PSYNC2"/>
          <bitfield caption="PSCOUT23 Output Enable" mask="0x08" name="POEN2D"/>
          <bitfield caption="PSCOUT21 Output Enable" mask="0x04" name="POEN2B"/>
          <bitfield caption="PSCOUT22 Output Enable" mask="0x02" name="POEN2C"/>
          <bitfield caption="PSCOUT20 Output Enable" mask="0x01" name="POEN2A"/>
        </register>
        <register caption="PSC2 Interrupt Mask Register" name="PIM2" offset="0x33" size="1">
          <bitfield caption="PSC 2 Synchro Error Interrupt Enable" mask="0x20" name="PSEIE2"/>
          <bitfield caption="External Event B Interrupt Enable" mask="0x10" name="PEVE2B"/>
          <bitfield caption="External Event A Interrupt Enable" mask="0x08" name="PEVE2A"/>
          <bitfield caption="End of Enhanced Cycle Interrupt Enable" mask="0x02" name="PEOEPE2"/>
          <bitfield caption="End of Cycle Interrupt Enable" mask="0x01" name="PEOPE2"/>
        </register>
        <register caption="PSC2 Interrupt Flag Register" name="PIFR2" offset="0x34" size="1">
          <bitfield caption="PSC 2 Output A Activity" mask="0x80" name="POAC2B"/>
          <bitfield caption="PSC 2 Output A Activity" mask="0x40" name="POAC2A"/>
          <bitfield caption="PSC 2 Synchro Error Interrupt" mask="0x20" name="PSEI2"/>
          <bitfield caption="External Event B Interrupt" mask="0x10" name="PEV2B"/>
          <bitfield caption="External Event A Interrupt" mask="0x08" name="PEV2A"/>
          <bitfield caption="Ramp Number" mask="0x06" name="PRN2"/>
          <bitfield caption="End of PSC2 Interrupt" mask="0x01" name="PEOP2"/>
        </register>
        <register caption="Analog Synchronization Delay Register" name="PASDLY2" offset="0x71" size="1">
          <bitfield caption="Analog Synchronization Delay bits" mask="0xFF" name="PASDLY2"/>
        </register>
      </register-group>
    </module>
    <module caption="Timer/Counter, 16-bit" name="TC16">
      <register-group caption="Timer/Counter, 16-bit" name="TC1">
        <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK1" offset="0x21" size="1">
          <bitfield caption="Timer/Counter1 Input Capture Interrupt Enable" mask="0x20" name="ICIE1"/>
          <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x01" name="TOIE1"/>
        </register>
        <register caption="Timer/Counter Interrupt Flag register" name="TIFR1" offset="0x22" size="1" ocd-rw="R">
          <bitfield caption="Input Capture Flag 1" mask="0x20" name="ICF1"/>
          <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x01" name="TOV1"/>
        </register>
        <register caption="Timer/Counter1 Control Register B" name="TCCR1B" offset="0x8A" size="1">
          <bitfield caption="Input Capture 1 Noise Canceler" mask="0x80" name="ICNC1"/>
          <bitfield caption="Input Capture 1 Edge Select" mask="0x40" name="ICES1"/>
          <bitfield caption="Waveform Generation Mode" mask="0x10" name="WGM13"/>
          <bitfield caption="Prescaler source of Timer/Counter 1" mask="0x07" name="CS1" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="Timer/Counter1 Bytes" name="TCNT1" offset="0x5A" size="2">
          <bitfield caption="Timer/Counter 1 bits" mask="0xFFFF" name="TCNT1"/>
        </register>
        <register caption="Timer/Counter1 Input Capture Register Bytes" name="ICR1" offset="0x8C" size="2">
          <bitfield caption="Timer/Counter1 Input Capture bits" mask="0xFFFF" name="ICR1"/>
        </register>
      </register-group>
